In [1]:
import pandas as pd

In [3]:
data = {
    'Product_ID': [101, 102, 103, 104, 105],
    'Product_Name': ['Laptop', 'Smartphone', 'Tablet', 'Headphones', 'Smartwatch'],
    'Category': ['Electronics', 'Electronics', 'Electronics', 'Accessories', 'Electronics'],
    'Price': [1200, 800, 400, 100, 300],
    'Quantity_Sold': [50, 100, 80, 200, 120]
}

In [4]:
products = pd.DataFrame(data)

In [5]:
products

   Product_ID Product_Name     Category  Price  Quantity_Sold
0         101       Laptop  Electronics   1200             50
1         102   Smartphone  Electronics    800            100
2         103       Tablet  Electronics    400             80
3         104   Headphones  Accessories    100            200
4         105   Smartwatch  Electronics    300            120

In [6]:
total_revenue_for_each_product = products["Price"] * products["Quantity_Sold"]

In [7]:
total_revenue_for_each_product

0    60000
1    80000
2    32000
3    20000
4    36000
dtype: int64

In [8]:
total_revenue_for_all_products = total_revenue_for_each_product.sum()

In [9]:
total_revenue_for_all_products

228000

In [10]:
products["Price"].mean()

560.0

In [11]:
products["Price"].median()

400.0

In [12]:
products["Quantity_Sold"].mean()

110.0

In [13]:
products["Quantity_Sold"].median()

100.0

In [14]:
products_concat = pd.concat([products, products], axis = 1)

In [15]:
products_concat

,Product_ID,Product_Name,Category,Price,Quantity_Sold,Product_ID,Product_Name,Category,Price,Quantity_Sold
0,101,Laptop,Electronics,1200,50,101,Laptop,Electronics,1200,50
1,102,Smartphone,Electronics,800,100,102,Smartphone,Electronics,800,100
2,103,Tablet,Electronics,400,80,103,Tablet,Electronics,400,80
3,104,Headphones,Accessories,100,200,104,Headphones,Accessories,100,200
4,105,Smartwatch,Electronics,300,120,105,Smartwatch,Electronics,300,120

In [17]:
products.loc[2, "Price"] = pd.NA

In [18]:
products

   Product_ID Product_Name     Category   Price  Quantity_Sold
0         101       Laptop  Electronics  1200.0             50
1         102   Smartphone  Electronics   800.0            100
2         103       Tablet  Electronics     NaN             80
3         104   Headphones  Accessories   100.0            200
4         105   Smartwatch  Electronics   300.0            120

In [19]:
products.loc[3, "Quantity_Sold"] = pd.NA

In [20]:
products

   Product_ID Product_Name     Category   Price  Quantity_Sold
0         101       Laptop  Electronics  1200.0           50.0
1         102   Smartphone  Electronics   800.0          100.0
2         103       Tablet  Electronics     NaN           80.0
3         104   Headphones  Accessories   100.0            NaN
4         105   Smartwatch  Electronics   300.0          120.0

In [21]:
products_filled = products.fillna(products.mean(numeric_only=True))

In [22]:
products_filled

   Product_ID Product_Name     Category   Price  Quantity_Sold
0         101       Laptop  Electronics  1200.0           50.0
1         102   Smartphone  Electronics   800.0          100.0
2         103       Tablet  Electronics   600.0           80.0
3         104   Headphones  Accessories   100.0           87.5
4         105   Smartwatch  Electronics   300.0          120.0

In [23]:
products.loc[3, "Quantity_Sold"] = pd.NA

In [24]:
products

   Product_ID Product_Name     Category   Price  Quantity_Sold
0         101       Laptop  Electronics  1200.0           50.0
1         102   Smartphone  Electronics   800.0          100.0
2         103       Tablet  Electronics     NaN           80.0
3         104   Headphones  Accessories   100.0            NaN
4         105   Smartwatch  Electronics   300.0          120.0

In [25]:
products.dropna()

   Product_ID Product_Name     Category   Price  Quantity_Sold
0         101       Laptop  Electronics  1200.0           50.0
1         102   Smartphone  Electronics   800.0          100.0
4         105   Smartwatch  Electronics   300.0          120.0